БухЭксп/Enums/CW_Платформа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_Платформа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Linux</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Windows</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТомаАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТомаАрхива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_Платформа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/_ФА/Ext/Module.bsl
//МОДУЛЬ УСТАРЕЛ!
//Следует использовать модули:
// - CW_РаботаСФайламиКлиент;
// - CW_РаботаСФайламиСервер;
// - CW_РаботаСФайламиСлужебныйКлиент;
//

Функция ЗагрузитьФайлАрхива(ОбъектАрхива,АдресФайла) Экспорт 
	
	// проверяем том хранения и его атрибуты
	
	Том = ОбъектАрхива.Том;
	
	СтруктураОтвета = _сф.ст_Создать("Код,ОписаниеОшибки");
	
	Если Том.Пустая() Тогда
		
		СтруктураОтвета.Код = 1;
		СтруктураОтвета.ОписаниеОшибки = "Не указан том хранения!";
		
		Возврат(СтруктураОтвета);
		
	КонецЕсли; 
	
	Если НЕ ВозможностьЗаписиВТом(ОбъектАрхива.Том) Тогда
			
			СтруктураОтвета.Код = 1;
			СтруктураОтвета.ОписаниеОшибки = "Том не активен или в режиме ""Только чтение!""";
			
			Возврат(СтруктураОтвета);
			
		КонецЕсли;	
	
	Попытка
				 		
		ДД = ПолучитьИзВременногоХранилища(АдресФайла);
		ДД.Записать(ПолучитьПолноеИмяФайла(ОбъектАрхива)); 
		
		СтруктураОтвета.Код = 0;
		
	Исключение
		
		СтруктураОтвета.Код = 1;
		СтруктураОтвета.ОписаниеОшибки = "Ошибка записи файла в том!"+Символы.ПС+ОписаниеОшибки();
		
	КонецПопытки; 
	
	Возврат(СтруктураОтвета);	
	
КонецФункции

// функция добавления файла на сервере к объекту
Функция ДобавитьФайл(ОбъектБазы,ИмяФайла,ДополнительныеПараметры=Неопределено) Экспорт 
	// --- 
	
	Попытка
		
		НоваяСсылка = Справочники.CW_ОбъектыАрхива.ПолучитьСсылку(Новый УникальныйИдентификатор);
	
		ТомХранения  = ПолучитьОсновнойТомХранения();
		ТипДокумента = Неопределено;
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			ПереданныйТомХранения = _сф.ст_ПолучитьСвойство(ДополнительныеПараметры,"Том"); 
			Если ПереданныйТомХранения <> Неопределено Тогда
				ТомХранения = ПереданныйТомХранения;	
			КонецЕсли;
			
			ДополнительныеПараметры.Свойство("ТипДокумента", ТипДокумента);
		КонецЕсли;   
		
		Если ТомХранения.Платформа = Перечисления.CW_Платформа.Linux Тогда
			Разделитель = "/";
		Иначе
			Разделитель = "\";
		КонецЕсли; 
		
		Путь 	= ТомХранения.Путь;
		ИмяТома = Строка(НоваяСсылка.УникальныйИдентификатор());
		ИмяФайлаВАрхиве = ТомХранения.Путь+Разделитель+ИмяТома;
		
		КопироватьФайл(ИмяФайла, ИмяФайлаВАрхиве);
		
		ФайлАрхива = Новый Файл(ИмяФайлаВАрхиве);
		Размер = ФайлАрхива.Размер();


		КороткоеИмяФайла = _сф.ф_КороткоеИмяФайла(ИмяФайла);

		ПозицияТочки 	= СтрНайти(КороткоеИмяФайла, ".", НаправлениеПоиска.СКонца);
		РасширениеФайла = Сред(КороткоеИмяФайла, ПозицияТочки); 
	
		
		ОбъектАрхива = Справочники.CW_ОбъектыАрхива.СоздатьЭлемент();  
		
		ОбъектАрхива.Владелец 		= ОбъектБазы;
		ОбъектАрхива.Объект 		= ОбъектБазы;
		ОбъектАрхива.Том 			= ТомХранения;  
		ОбъектАрхива.ТипДокумента	= ТипДокумента;  
		ОбъектАрхива.ИмяФайла 		= КороткоеИмяФайла;  
		ОбъектАрхива.Расширение 	= РасширениеФайла;
		ОбъектАрхива.Наименование 	= КороткоеИмяФайла;
		ОбъектАрхива.ФайлЗагружен	= Истина; 
		ОбъектАрхива.Размер	 		= Размер;
		
		ОбъектАрхива.УстановитьСсылкуНового(НоваяСсылка);
		ОбъектАрхива.Записать();
		
		Ответ = _УФКС.Ответ();
		Ответ.Вставить("СсылкаОбъектаАрхива",НоваяСсылка);
		
		Возврат(Ответ);
		
	Исключение
	    
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
		
	// --- 
КонецФункции

// --- 

Функция ПолучитьОсновнойТомХранения() Экспорт 
	// --- 
	
	// установим том
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТомаАрхива.Ссылка
	|ИЗ
	|	Справочник.CW_ТомаАрхива КАК ТомаАрхива
	|ГДЕ
	|	ТомаАрхива.Основной = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат(Выборка.Ссылка);
		
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);
	
	// --- 
КонецФункции
    

// --- 

Функция ПолучитьФайлАрхива(ОбъектАрхива,УИД=Неопределено) Экспорт 
	
	Если (НЕ ОбъектАрхива.ФайлЗагружен) Тогда
		
		СтруктураОтвета = _сф.ст_Создать("Код,ОписаниеОшибки");
		СтруктураОтвета.Код=1;
		СтруктураОтвета.ОписаниеОшибки = "Файл не загружен.";
		
		Возврат(СтруктураОтвета);
		
	КонецЕсли; 
	
	Попытка
		
		ДД = Новый ДвоичныеДанные(ПолучитьПолноеИмяФайла(ОбъектАрхива));
		АдресФайла = ПоместитьВоВременноеХранилище(ДД,УИД);
		ИмяФайла = ОбъектАрхива.ИмяФайла;
		
		// --- 
		
		СтруктураОтвета = _сф.ст_Создать("Код,ИмяФайла,АдресФайла");
		СтруктураОтвета.Код = 0;
		СтруктураОтвета.ИмяФайла = ИмяФайла;
		СтруктураОтвета.АдресФайла = АдресФайла;
		
		Возврат(СтруктураОтвета);
		
	Исключение
		
		СтруктураОтвета = _сф.ст_Создать("Код,ОписаниеОшибки");
		СтруктураОтвета.Код=1;
		СтруктураОтвета.ОписаниеОшибки = "Ошибка получения файла:"+ОписаниеОшибки();
		
		Возврат(СтруктураОтвета);
		
	КонецПопытки; 
		
КонецФункции

// --- 

Функция УдалитьФайлТома(ОбъектАрхива) Экспорт 
	
	СтруктураОтвета = _сф.ст_Создать("Код,ОписаниеОшибки");
	
	Файл = Новый Файл(ПолучитьПолноеИмяФайла(ОбъектАрхива));
	Если Файл.Существует() Тогда
		
		Если НЕ ВозможностьЗаписиВТом(ОбъектАрхива.Том) Тогда
			
			СтруктураОтвета.Код = 1;
			СтруктураОтвета.ОписаниеОшибки = "Том не активен или в режиме ""Только чтение!""";
			
			Возврат(СтруктураОтвета);
			
		КонецЕсли;  
		
		// пробуем удалить
		
		Попытка
			
			СтруктураФайла = _сф.ф_СтруктураФайла(Файл.ПолноеИмя); 
			УдалитьФайлы(СтруктураФайла.Путь,СтруктураФайла.Имя);
			
		Исключение
			
			СтруктураОтвета.Код = 1;
			СтруктураОтвета.ОписаниеОшибки = "Ошибка удаления файла """+Строка(Файл.Имя)+""": "+ОписаниеОшибки();
			Возврат(СтруктураОтвета);
			
		КонецПопытки; 
		
		СтруктураОтвета.Код=0;
		Возврат(СтруктураОтвета);
		
	Иначе
		
		// и ... с ним
		СтруктураОтвета.Код=0;
		Возврат(СтруктураОтвета);
		
	КонецЕсли; 
	
КонецФункции

// --- 

Функция ВозможностьЗаписиВТом(Том) Экспорт 
	
	Если (Том.Пустая()) Тогда
		
		Возврат(Ложь);
		
	Иначе
		
		Если Том.ТолькоЧтение ИЛИ НЕ Том.Активный Тогда
			
			Возврат(Ложь);
			
		Иначе
			
			Возврат(Истина);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

// --- 
 
Функция ПолучитьПолноеИмяФайла(ОбъектАрхива) Экспорт 
	
	Если ОбъектАрхива.Том.Платформа=Перечисления.CW_Платформа.Linux Тогда
		Разделитель = "/";
	Иначе
		Разделитель = "\";
	КонецЕсли; 
	
	Путь 	=  ОбъектАрхива.Том.Путь;
	ИмяТома =  Строка(ОбъектАрхива.УникальныйИдентификатор());
	
	Если ЗначениеЗаполнено(ОбъектАрхива.ОбъектАрхиваВладелец) Тогда
		Путь 	=  ОбъектАрхива.ОбъектАрхиваВладелец.Том.Путь;
		ИмяТома =  Строка(ОбъектАрхива.ОбъектАрхиваВладелец.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат Путь+Разделитель+ИмяТома;
	
КонецФункции

// ---------------------------------------------------------------------------- 

Функция РегламентнаяПроверкаТомов() Экспорт 
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТомаАрхива.Ссылка
	|ИЗ
	|	Справочник.CW_ТомаАрхива КАК ТомаАрхива
	|ГДЕ
	|	ТомаАрхива.Активный = ИСТИНА
	|	И ТомаАрхива.ТолькоЧтение = ЛОЖЬ";
	Тома = Запрос.Выполнить().Выгрузить();
	
	Для каждого Том Из Тома.ВыгрузитьКолонку("Ссылка") Цикл
		
		// --- 
		
		Попытка
			
			МассивСообщений = Новый Массив;
			ОчередьНаУдаление = Новый Массив;
			
			// 
			МассивФайлов = НайтиФайлы(Том.Путь,"*");
			КартаФайловКаталога = Новый Соответствие();
			Для каждого ФайлМассива Из МассивФайлов Цикл
				
				Если НЕ ФайлМассива.ЭтоКаталог() Тогда
					
					КартаФайловКаталога.Вставить(Новый УникальныйИдентификатор(ФайлМассива.Имя),ФайлМассива);
					
				КонецЕсли; 
				
			КонецЦикла; 
			// --- 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОбъектыАрхива.Ссылка
			|ИЗ
			|	Справочник.ОбъектыАрхива КАК ОбъектыАрхива
			|ГДЕ
			|	ОбъектыАрхива.Том = &Том";
			Запрос.УстановитьПараметр("Том", Том);
			ФайлыБазы = Запрос.Выполнить().Выгрузить();
			КартаФайловБазы = Новый Соответствие();
			Для каждого ФайлТЗ Из ФайлыБазы.ВыгрузитьКолонку("Ссылка") Цикл
				
				КартаФайловБазы.Вставить(ФайлТЗ.УникальныйИдентификатор(),ФайлТЗ);
				
			КонецЦикла; 
			
			// --- 
			
			// бежим по файлам каталога, если не находим соответствие в базе - добавляем в очередь на удаление
			
			Для каждого СтрокаКарты Из КартаФайловКаталога Цикл
				
				ФайлБазы = КартаФайловБазы.Получить(СтрокаКарты.Ключ);
				
				Если ФайлБазы = Неопределено Тогда
					
					ОчередьНаУдаление.Добавить(СтрокаКарты.Значение);
					
				Иначе
					
					РазмерФайла = СтрокаКарты.Значение.Размер(); 
					Если ФайлБазы.Размер <> РазмерФайла Тогда
						
						Попытка
							
							ФайлОбъект = ФайлБазы.ПолучитьОбъект();
							ФайлОбъект.Размер = РазмерФайла;
							ФайлОбъект.Записать();
							
							МассивСообщений.Добавить("Исправлен размер файла "+ПолучитьНавигационнуюСсылку(ФайлБазы)+" : "+Строка(РазмерФайла));
							
						Исключение
							МассивСообщений.Добавить("Ошибка записи размера файла "+ПолучитьНавигационнуюСсылку(ФайлБазы)+" : "+ОписаниеОшибки());
						КонецПопытки; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			// --- 
			
			// удаляем
			Для каждого УдаляемыйФайл Из ОчередьНаУдаление Цикл
				
				Попытка
					
					УдалитьФайлы(УдаляемыйФайл.ПолноеИмя);
					
				Исключение
					
					МассивСообщений.Добавить("Ошибка удаления файла "+УдаляемыйФайл.ПолноеИмя+" : "+ОписаниеОшибки());
					
				КонецПопытки; 
				
			КонецЦикла; 
			
			// --- 
			
			// теперь проверяем целостность
			
			Для каждого СтрокаКарты Из КартаФайловБазы Цикл
				
				Если СтрокаКарты.Значение.ФайлЗагружен Тогда
					
					ФайлКаталога = КартаФайловКаталога.Получить(СтрокаКарты.Ключ);
					Если ФайлКаталога = Неопределено Тогда
						
						// ошибка, нет файла в каталоге
						МассивСообщений.Добавить("Объект архива ("+ПолучитьНавигационнуюСсылку(СтрокаКарты.Значение)+") : не найден файл тома!");					
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если МассивСообщений.Количество() <> 0 Тогда
				
				ТекстСообщения = "Том:"+Строка(Том)+"("+ПолучитьНавигационнуюСсылку(Том)+")";
				Для каждого СообщениеМассива Из МассивСообщений Цикл
					
					ТекстСообщения = ТекстСообщения+Символы.ПС+СообщениеМассива;
					
				КонецЦикла; 
				
				Справочники.СистемныеСообщения.Добавить("Проверка томов",ТекстСообщения);
				
			КонецЕсли; 
			
		Исключение
			
			Справочники.СистемныеСообщения.Добавить("Проверка томов","Том:"+Строка(Том)+"("+ПолучитьНавигационнуюСсылку(Том)+"):"+ОписаниеОшибки());			
			
		КонецПопытки; 
		
	КонецЦикла; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

Функция КоличествоФайловОбъекта(ОбъектБазы) Экспорт 
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыАрхива.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК ОбъектыАрхива
	               |ГДЕ
	               |	ОбъектыАрхива.Объект = &Объект
	               |	И ОбъектыАрхива.ФайлЗагружен = ИСТИНА";
	Запрос.УстановитьПараметр("Объект", ОбъектБазы);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат(ТЗ.Итог("Ссылка"));
	
	// --- 
КонецФункции
